import './smartphone.css';

export function Smartphone(){
    return(
        <div className='SmartphoneBlock'>
            <p className='SmartphoneBlockText'>Смартфон (англ. smartphone — умный телефон) — мобильный телефон (современный — как правило, с сенсорным экраном), дополненный функциональностью карманного персонального компьютера. Хотя в мобильных телефонах практически всегда были дополнительные функции (калькулятор, календарь), со временем выпускались все более и более интеллектуальные модели. С целью подчеркнуть возросшую функциональность и вычислительную мощность таких моделей был введён термин «смартфон».</p>
            <p className='SmartphoneBlockText'>Наличие полнофункциональной операционной системы делает смартфоны более привлекательными в глазах большинства пользователей, чем обычные мобильные телефон. Современные телефоны прекрасно справляются со многими задачами, выходящими за рамки телефонных: работа с электронной почтой, просмотр текстовых документов и электронных таблиц, работа с планировщиком задач и многими другими.</p>
            <p className='SmartphoneBlockText'>Расширение функциональности телефонов возможно за счёт J2ME-программ, которые поддерживаются практически всеми мобильными телефонами. Экран целого ряда мобильных телефонов не уступает большинству смартфонов. Многие модели оснащены разъёмом для карты памяти.</p>
        </div>
    )
}